{
  "4.4.0": {
    "description": "Hide world tags by default to players.",
    "date": "4-27-2018"
  },
  "4.3.5": {
    "description":
      "Hide children entities of hidden parents in overview lists.",
    "date": "4-24-2018",
    "changes": [
      "Fix misspelling in local tech world tags.",
      "Fix missing ritual combat things translation.",
      "Fix moon base situation misspelling."
    ]
  },
  "4.3.4": {
    "description":
      "Fix bug where large sectors in small viewports wouldn't render the system & black hole icons.",
    "date": "4-10-2018"
  },
  "4.3.3": {
    "description":
      "Fix clicking on map and, in some cases, the systems being deleted.",
    "date": "4-9-2018",
    "changes": [
      "Fix arrow size so that it looks consistent between monitor resolutions"
    ]
  },
  "4.3.2": {
    "description":
      "Prevent syncing when non-logged users try to create system from sector map.",
    "date": "4-8-2018"
  },
  "4.3.1": {
    "description": "Ensure active system is shown in the map.",
    "date": "4-8-2018"
  },
  "4.3.0": {
    "description": "Improve map and website performance.",
    "date": "4-7-2018",
    "changes": [
      "Increase the maximum sector size to 20x20 and allow more hexagons to be rendered at once.",
      "Only render the printable version of the sector when necessary to improve overall performance.",
      "Render sector map onto a canvas instead of SVG elements to improve performance of large sectors.",
      "Simplify system hover/move on map to prevent potential errors."
    ]
  },
  "4.2.3": {
    "description":
      "Fix problem with tags where edit would persist even when 'cancel' was selected.",
    "date": "4-2-2018"
  },
  "4.2.2": {
    "description":
      "Fix incorrectly formatted french translation for entity tags.",
    "date": "4-2-2018"
  },
  "4.2.1": {
    "description": "Fix adding/removing world tags from the sidebar.",
    "date": "4-2-2018",
    "changes": [
      "Add a couple missing translations",
      "Order world tags in sidebar edit dropdown for all languages",
      "Center hex tooltips for all languages",
      "Make the navigation sidebar design more resilient to longer text in other languages"
    ]
  },
  "4.2.0": {
    "description": "Add french translations for world tags.",
    "date": "3-30-2018"
  },
  "4.1.1": {
    "description":
      "When saving a new sector, update application state so that every new save doesn't create another sector.",
    "date": "3-28-2018"
  },
  "4.1.0": {
    "description": "Allow attribute values to be customized.",
    "date": "3-26-2018",
    "changes": [
      "Any entity attribute can be customized by clicking the dropdown, typing whatever you'd like, and hitting enter.",
      "Updates to French and German translations."
    ]
  },
  "4.0.0": {
    "description":
      "Optimize webapp start time and remove old sector converter.",
    "date": "3-23-2018",
    "changes": [
      "Locally saved sectors can no longer be retrieved.",
      "Remove the scripts that converted the old sector format into the new format.",
      "Optimize webapp startup time by only fetching the minimum amount of data necessary."
    ]
  },
  "3.14.2": {
    "description":
      "Fix problem with translations when an attribute is undefined.",
    "date": "3-21-2018"
  },
  "3.14.1": {
    "description": "Allow planets to be children of black holes.",
    "date": "3-21-2018"
  },
  "3.14.0": {
    "description": "Internationalization.",
    "date": "3-21-2018",
    "changes": [
      "Adds French, German, and Swedish translations (not all english text is translated yet).",
      "Choose your preferred language in your user account."
    ]
  },
  "3.13.0": {
    "description": "Add new cosmic (Sector, system, planet) names.",
    "date": "3-18-2018"
  },
  "3.12.0": {
    "description": "Add way to export entity tables from the overview header.",
    "date": "3-13-2018"
  },
  "3.11.2": {
    "description": "Fix misaligned system tooltips in the sector map.",
    "date": "3-13-2018"
  },
  "3.11.1": {
    "description": "Add a selected state to the overview list.",
    "date": "3-10-2018"
  },
  "3.11.0": {
    "description": "Sector summary view.",
    "date": "3-10-2018",
    "changes": [
      "View all entity types in your sector in a convenient table.",
      "Entities link back to sector map when clicked in the table.",
      "Summary table columns are sortable by selecting the column headers.",
      "Navigation bar to easily switch between sector map and overview."
    ]
  },
  "3.10.1": {
    "description": "Minor fix for entity generation in the sidebar.",
    "date": "3-3-2018"
  },
  "3.10.0": {
    "description": "Markdown notes for any entity.",
    "date": "3-3-2018"
  },
  "3.9.2": {
    "description": "Protect against entities that don't have a parent anymore.",
    "date": "3-2-2018"
  },
  "3.9.1": {
    "description":
      "Fix error that renders a blank page when compiling printable information.",
    "date": "3-2-2018"
  },
  "3.9.0": {
    "description": "Multiple print options.",
    "date": "3-2-2018",
    "changes": [
      "Additional points of interest print support.",
      "Expanded print option with one entity per page for note taking.",
      "Condensed print option with one entity type per table to easily get an overview.",
      "Fixed a small issue where moon and moon base names didn't get saved correctly."
    ]
  },
  "3.8.0": {
    "description": "Show active hex in sector map.",
    "date": "2-13-2018"
  },
  "3.7.0": {
    "description": "Limit synced sectors to a maximum of 5.",
    "date": "2-13-2018"
  },
  "3.6.1": {
    "description": "Fix child num offset in print dialog.",
    "date": "2-12-2018",
    "changes": ["Render systems & black holes differently in print view."]
  },
  "3.6.0": {
    "description": "Add a short description to any entity when in edit mode.",
    "date": "2-11-2018"
  },
  "3.5.0": {
    "description":
      "Use deep space station attributes for space station as well.",
    "date": "2-7-2018"
  },
  "3.4.0": {
    "description":
      "Persisting sector updates locally is no longer possible. You'll need to sign up to sync them.",
    "date": "2-4-2018"
  },
  "3.3.0": {
    "description":
      "Allow entities to be hidden from anyone who is not the sector's creator (a.k.a. your players).",
    "date": "2-4-2018"
  },
  "3.2.0": {
    "description":
      "Remove asteroid belts and deep space stations from sector (spike drill can't make it there).",
    "date": "2-1-2018",
    "changes": [
      "Reconfigured asteroid belts to be apart of a system",
      "Reconfigured deep space stations to be apart of a system",
      "Deactivate sidebar edit when clicking on the sector view"
    ]
  },
  "3.1.2": {
    "description": "Fix typos in the doomed world tag.",
    "date": "2-1-2018"
  },
  "3.1.1": {
    "description": "Fix bug where an old sector couldn't be deleted.",
    "date": "2-1-2018"
  },
  "3.1.0": {
    "description": "Additional Points of Interest.",
    "date": "2-1-2018",
    "changes": [
      "The additional points of interest are added into the generator.",
      "You can toggle off additional points of interest in the generator by going into configure.",
      "New entity creation modal when long-clicking on a hexagon since new icons/entities have been introduced.",
      "Entity lists in the sidebar are now collapsible in edit mode and normal mode."
    ]
  },
  "3.0.1": {
    "description":
      "Fix minor issue where the last viewed sector overlays the changelog page.",
    "date": "1-16-2018"
  },
  "3.0.0": {
    "description": "Rewrite how sector data is stored and handled.",
    "date": "1-16-2018",
    "changes": [
      "When editing an entity in the sidebar, the sidebar will be converted into an editable view.",
      "When adding children entities in the sidebar, an option to generate the entity data is given.",
      "Saving sectors, moving systems, and editing entities in general should be a lot faster."
    ]
  },
  "2.3.0": {
    "description": "Add a donations button in the sidebar footer.",
    "date": "1-10-2018"
  },
  "2.2.2": {
    "description": "Fix missing changelog descriptions and add dates.",
    "date": "12-25-2017"
  },
  "2.2.1": {
    "description":
      "Fix issue where planets in name would open a creation modal instead of an edit modal.",
    "date": "11-14-2017"
  },
  "2.2.0": {
    "description": "Quick add buttons in system and planet lists.",
    "date": "11-12-2017"
  },
  "2.1.1": {
    "description":
      "Fix issue where the sector builder wasn't being initialized.",
    "date": "11-11-2017"
  },
  "2.1.0": {
    "description": "Create new ungenerated planets.",
    "date": "11-11-2017",
    "changes": [
      "A new and improved planet list is shown in the system edit/create modal.",
      "The checkboxes next to the planets in the system edit/create modal toggles planet generation.",
      "You can now remove planet attributes by unsetting them in the planet edit modal."
    ]
  },
  "2.0.0": {
    "description": "User Accounts & Sharing",
    "date": "11-5-2017",
    "changes": [
      "You can now signup via Facebook, Google, or standard email/password.",
      "All locally saved sectors will be automatically synced upon successful signup.",
      "Once synced, sharing will now be enabled across all your sectors. Anyone can see your sectors with the correct URL you share out.",
      "Builder option has been moved to the configuration options.",
      "Click directly into a saved sector from the home page. You'll still be able to delete sectors via the sidebar."
    ]
  },
  "1.11.0": {
    "description": "Added a 'Builder' option to initialize a blank sector.",
    "date": "10-10-2017"
  },
  "1.10.0": {
    "description":
      "Add a system by long-clicking on an empty hex in the sector view.",
    "date": "10-8-2017"
  },
  "1.9.0": {
    "description": "Delete systems and planets from the sidebar header.",
    "date": "10-7-2017",
    "changes": [
      "Don't worry if you accidentally click the delete button because a confirmation modal will pop up.",
      "Fixed an issue where the sector name, once changed, will always show the original name in the edit sector modal."
    ]
  },
  "1.8.3": {
    "description": "Add windows build support.",
    "date": "10-7-2017"
  },
  "1.8.2": {
    "description":
      "In large viewports don't show the 'Browser window too small' message.",
    "date": "10-4-2017"
  },
  "1.8.1": {
    "description": "Fix sector title custom edit.",
    "date": "10-4-2017"
  },
  "1.8.0": {
    "description": "Planet creation and deletion from system edit.",
    "date": "10-4-2017",
    "changes": [
      "In the system edit, there is a new planet multi-select.",
      "To create a freshly generated planet, type planet name in multi-select, hit enter, and then save.",
      "To delete planets, removing from the planet multi-select and hit save."
    ]
  },
  "1.7.0": {
    "description": "Planet information is now editable.",
    "date": "9-16-2017",
    "changes": [
      "Tech Level, Atmosphere, Temperature, Biosphere, and Population you can edit with a dropdown.",
      "You can add and remove world tags to your heart's content."
    ]
  },
  "1.6.0": {
    "description": "The sector, system, and planet names are now editable.",
    "date": "9-11-2017",
    "changes": [
      "New text links instead of the icon links in the information sidebar.",
      "Rename to your own custom name or just get a new randomly generated name by selecting the refresh icon in the edit modal.",
      "Once a sector, system, or planet is renamed the entire sector is saved so you don't loose your progress."
    ]
  },
  "1.5.0": {
    "description":
      "Add tests to the sector generator utilities so the core of the app doesn't break on subsequent changes.",
    "date": "9-9-2017"
  },
  "1.4.3": {
    "description": "Browser doesn't hang if viewing site in a small viewport.",
    "date": "9-9-2017",
    "changes": [
      "An error message will appear when viewport is too small rather than rendering all the hexagons.",
      "Will stop rendering hexagons if the total number reaches 800 or a viewport dimension is less than 200 pixels."
    ]
  },
  "1.4.2": {
    "description": "Fixes missing bold fonts in Chrome print view.",
    "date": "9-7-2017"
  },
  "1.4.1": {
    "description": "Fixes buggy system movement.",
    "date": "9-6-2017",
    "changes": [
      "Hexagons touch each other and have a stroke width to speed up hover and system movement. This doesn't change how the sectors looks.",
      "The movement vector line ignores the mouse so that it doesn't interrupt system movement by breaking the hover.",
      "Upgrade prettier.",
      "Adds some SEO related meta tags to the base html."
    ]
  },
  "1.4.0": {
    "description": "Adds link to Github repository in sidebar navigation.",
    "date": "8-24-2017"
  },
  "1.3.0": {
    "description": "Adds changelog. Link in sidebar navigation.",
    "date": "8-22-2017"
  },
  "1.2.0": {
    "description":
      "Adds system movement. Click and hold any system in the grid, drag to a new location, and let go.",
    "date": "8-15-2017",
    "changes": [
      "Any un-saved sector will be saved on system movement.",
      "Adds long click highlighting and direction vector for selected system and destination."
    ]
  },
  "1.1.0": {
    "description":
      "Ability to save a sector to the current browser. This is a local save rather than persistance to a backend.",
    "date": "8-13-2017",
    "changes": [
      "Save any generated sector locally.",
      "Load previous saves on dashboard."
    ]
  },
  "1.0.0": {
    "description":
      "A scalable SVG viewport based on screen size with a random generator by seed.",
    "date": "8-11-2017",
    "changes": [
      "Randomly assign revised edition world tags.",
      "Print view with save as PDF option.",
      "Add Share URL with link in sidebar.",
      "Seed, row number, and column number configuration."
    ]
  }
}
